tap "brimdata/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

#### LANGUAGES ####
brew "gcc"
brew "llvm"  # 
brew "php"
brew "go"
brew "lua"
brew "luajit"  # Lua Just-In-Time Compiler
brew "luarocks"  # Lua Package Manager
brew "zig"  # Zig Language
brew "zls"  # Zig Language Server
brew "python"
brew "cue"  # Constraint-based Configuration Language
brew "bash"
brew "node"
brew "openjdk"
brew "rust"

#### LANGUAGE TOOLS/SERVICES ####
brew "pipx" # Python application manager
brew "page" # man pager
brew "asciidoctor"
brew "plantuml"
brew "shfmt"
brew "markdownlint-cli"
brew "marksman"
brew "rust-analyzer"


#### DEV TOOLS ####
brew "neovim"
brew "tmux"
brew "curl"
brew "wget"
brew "direnv"
brew "gh"
brew "lazygit"
brew "mkcert"
brew "koekeishiya/formulae/yabai"
brew "pngpaste"  # nvim paste image from clipboard


#### FILESYSTEM TOOLS ####
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "trash"
brew "zoxide"
brew "sponge"
brew "stow"
brew "sd"
brew "tldr"
brew "neofetch"


#### NETWORK LIBS/TOOLS ####
brew "netcat"
brew "nmap"

#### SECURITY LIBS/TOOLS ####
brew "openssl@3"
brew "openssl@1.1"
brew "cryptography"

#### OS LIBS/TOOLS ####
brew "xz"
brew "zlib"
brew "btop"
brew "imagemagick"
brew "pueue", restart_service: true


#### GNU TOOLS ####
brew "coreutils" # Core GNU Tools
brew "bc"
brew "findutils"
brew "gnutls"
brew "gawk"
brew "gnupg"
brew "grep"
brew "make"
brew "parallel"
brew "pass"


#### DATA MANIPULATION ####
brew "jq"
brew "yq"
brew "brimdata/tap/zed"
brew "brimdata/tap/zq"


#### CONTAINER TOOLS ####
brew "qemu"
brew "lima"
brew "colima"
brew "k9s"
brew "kubernetes-cli"
brew "helm"
brew "argocd"

#### AWS TOOLS ####
brew "aws-nuke"
brew "aws-sam-cli"
brew "awscli"
brew "cfn-lint"


###### KEYBOARD FIRMWARE (QMK) ######
brew "qmk/qmk/qmk"
brew "osx-cross/avr/avr-gcc@8"
cask "gcc-arm-embedded"


#### DESKTOP APPS ####

# Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"
# Terminal emulator
cask "kitty"
# File manager
cask "marta"
# Screenshot annotations
cask "skitch"
# Auto-kills ITunes (Music) App
cask "notunes"
# Chat
cask "slack"
cask "discord"
# Sublime Text
cask "sublime-text"
# VS Code
cask "visual-studio-code"
# Clipboard manager
cask "maccy"
# Container management
cask "docker"
# Hotkey manager
cask "karabiner-elements"
# Disk utilization
cask "grandperspective"
# MacOS Automation with Lua
cask "hammerspoon"

##### DESKTOP FONTS #####
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"

#### PAID APPS ####

# Password manager
cask "1password"
cask "1password-cli"

# Display Management
cask "lunar"

#### TODO (Still need to review these) ####
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "boost"
brew "bpytop"
brew "gdk-pixbuf"
brew "librsvg"
brew "chafa"
brew "cmake"
brew "unbound"
brew "libavif"
brew "libpq"
brew "composer"
brew "cookiecutter"
brew "dockly"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "openjpeg"
brew "ghostscript"
brew "git-delta"
brew "glow"
brew "gum"
brew "gomplate"
brew "netpbm"
brew "graphviz"
brew "helix"
brew "libheif"
brew "lazydocker"
brew "libxkbcommon"
brew "mdcat"
brew "navi"
brew "nushell"
brew "nss"
brew "prettierd"
brew "ptpython"
brew "rustup-init"
brew "scdoc"
